Hi @UntiIted , Thanks for raising this issue. 

**1 Question about groups**

Could you refer to @poroping's configuration to try again? I think his configuration is completely correct. My verification results here are as follows:

```hcl
# cat main.tf
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token    = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}

resource "fortios_firewall_policy" "test_firewall_policy" {
  name = "TST-SSL-VPN"

  srcintf {
    name = "port3"
  }

  dstintf {
    name = "port2"
  }

  groups {
    name = "Guest-group"  #<====================
  }

  srcaddr {
    name = "all"
  }

  dstaddr {
    name = "gmail.com"
  }

  schedule = "always"

  service {
    name = "ALL"
  }

  action          = "accept"
  inspection_mode = "flow"
  av_profile      = "wifi-default"
  ips_sensor      = "default"
  ssl_ssh_profile = "certificate-inspection"
  logtraffic      = "utm"
  status          = "enable"
  utm_status      = "enable"
}
```
```
# terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_firewall_policy.test_firewall_policy will be created
  + resource "fortios_firewall_policy" "test_firewall_policy" {
      + action                      = "accept"
      + anti_replay                 = (known after apply)
      + application_list            = (known after apply)
      + auth_cert                   = (known after apply)
      + auth_path                   = (known after apply)
      + webproxy_forward_server     = (known after apply)
      + webproxy_profile            = (known after apply)
      + wsso                        = (known after apply)

      + ..............

      + groups {
          + name = "Guest-group"
        }

      + service {
          + name = "ALL"
        }

      + srcaddr {
          + name = "all"
        }

      + srcintf {
          + name = "port3"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_policy.test_firewall_policy: Creating...
fortios_firewall_policy.test_firewall_policy: Creation complete after 0s [id=4]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

_**Result:**_
```
config firewall policy
    edit 4
        set name "TST-SSL-VPN"
        set uuid 9f967918-c30a-51eb-bb4b-9ffdecaf9d1c
        set srcintf "port3"
        set dstintf "port2"
        set srcaddr "all"
        set dstaddr "gmail.com"
        set action accept
        set schedule "always"
        set service "ALL"
        set utm-status enable
        set ssl-ssh-profile "certificate-inspection"
        set av-profile "wifi-default"
        set ips-sensor "default"
        set groups "Guest-group"
    next
end
```

In addition to the provider's documentation [terraform fortios_firewall_policy](https://registry.terraform.io/providers/fortinetdev/fortios/latest/docs/resources/fortios_firewall_policy
), you can also refer to the FortiGate manual [FortiGate 6.4.3 CLI firewall policy](https://docs.fortinet.com/document/fortigate/6.4.3/cli-reference/311620/firewall-policy): 
groups<name>| Names of user groups that can authenticate with this policy.Group name.


**2 Question about update**

Regarding the another question you mentioned:
`I would also like to note that all attempts to modify an existing FirewallPolicy resource fail with Error updating FirewallPolicy resource: cannot send request lost connection to firewall with error: Put`

I failed to reproduce your problem on FOS 6.4.3, the following are the steps that I successfully deployed on FortiOS 6.4.3 for your reference::

_**Step1: Configuration**_ 
```hcl
# cat main.tf
rresource "fortios_firewall_policy" "test_firewall_policy" {
  name = "TST-SSL-VPN"

  srcintf {
    name = "port3"
  }

  dstintf {
    name = "port2"
  }

  groups {
    name = "Guest-group"
  }

  srcaddr {
    name = "all"
  }

  dstaddr {
    name = "gmail.com"
  }

  schedule = "always"

  service {
    name = "ALL"
  }

  action          = "accept"
  inspection_mode = "flow"
  av_profile      = "wifi-default"
  ips_sensor      = "default"
  ssl_ssh_profile = "certificate-inspection"
  logtraffic      = "utm"
  status          = "enable"
  utm_status      = "enable"
}

```

_**Step2: terraform apply**_
```
# terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_firewall_policy.test_firewall_policy will be created
  + resource "fortios_firewall_policy" "test_firewall_policy" {
      + action                      = "accept"
      + anti_replay                 = (known after apply)
      + application_list            = (known after apply)
      + auth_cert                   = (known after apply)
      + auth_path                   = (known after apply)
..............
Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_policy.test_firewall_policy: Creating...
fortios_firewall_policy.test_firewall_policy: Creation complete after 0s [id=3]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

_**Step3: Change some argument(srcintf: port3->port4):**_
```hcl

resource "fortios_firewall_policy" "test_firewall_policy" {
  name = "TST-SSL-VPN"

  srcintf {
    name = "port4"                         #<========== port3->port4
  }

  dstintf {
    name = "port2"
  }

  groups {
    name = "Guest-group"
  }

  srcaddr {
    name = "all"
  }

  dstaddr {
    name = "gmail.com"
  }

  schedule = "always"

  service {
    name = "ALL"
  }

  action          = "accept" 
  inspection_mode = "flow"
  av_profile      = "wifi-default"
  ips_sensor      = "default"
  ssl_ssh_profile = "certificate-inspection"
  logtraffic      = "utm"
  status          = "enable"
  utm_status      = "enable"
}
```
_**Step4: terraform plan and terraform apply:**_
```
# terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_firewall_policy.test_firewall_policy: Refreshing state... [id=3]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # fortios_firewall_policy.test_firewall_policy will be updated in-place
  ~ resource "fortios_firewall_policy" "test_firewall_policy" {
        action                      = "deny" -> "accept"
        anti_replay                 = "enable"

....................

        groups {
            name = "Guest-group"
        }

        service {
            name = "ALL"
        }

        srcaddr {
            name = "all"
        }

      ~ srcintf {
          ~ name = "port3" -> "port4"
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

# terraform apply
fortios_firewall_policy.test_firewall_policy: Refreshing state... [id=3]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
...............

fortios_firewall_policy.test_firewall_policy: Modifying... [id=3]
fortios_firewall_policy.test_firewall_policy: Modifications complete after 0s [id=3]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```

_**Step5: Validation**_
```
labfirewall (policy) # show
config firewall policy
    edit 3
        set name "TST-SSL-VPN"
        set uuid 2a26f638-c30c-51eb-f589-69f86f69549a
        set srcintf "port4"   #<=======================================
        set dstintf "port2"
        set srcaddr "all"
        set dstaddr "gmail.com"
        set action accept
        set schedule "always"
        set service "ALL"
        set utm-status enable
        set ssl-ssh-profile "certificate-inspection"
        set av-profile "wifi-default"
        set ips-sensor "default"
        set groups "Guest-group"
    next
end
```

BTW: From the result info of your code execution, it seems that something is blocking the connection between your client computer and Firewall. Can you please check again or post your configuration code here? If you require any further information, feel free to contact me. Thank you!


